Repository: Amreeta-18/alpaca
Catalog: priv/lang/alpaca.*.po
Languages: de_de

source: builtin_type_arity_error %(type) %(num_expected) %(num_supplied)
de_de: Falsche Anzahl an Parametern für eingebauten Typ"%(type)". Erwartet %(num_expected), erhalten %(num_supplied).

source: duplicate_definition %(id)
de_de: Mehrfache Definition von "%(id)".

source: duplicate_type_definition %(id)
de_de: Der Typ "%(id)" wurde bereits definiert.

source: function_not_exported %(mod) %(fun)
de_de: Das Modul "%(mod)" exportiert die Funktion "%(fun)" nicht.

source: incomplete_expression
de_de: Ausdruck endet unerwartet.

source: invalid_bin_qualifier %(qualifier)
de_de: Inkorrekte Binärqualifizierung für "%(qualifier)". Erlaubt sind "end", "sign", "size", "type" und "unit."

source: invalid_bin_type %(type)
de_de: Inkorrekter Anteil in Binärtyp "%(type)". Erlaubt sind "binary", "float", "int" und "utf8".

source: invalid_endianness %(endianness)
de_de: Inkorrekte Byte-Reihenfolge "%(endianness)". Erlaubt sind "big", "little" und "native".

source: invalid_fun_parameter
de_de: Inkorrektes Funktionsargumentmuster.

source: invalid_top_level_construct
de_de: Dieses Konstrukt darf nicht auf oberster Ebene vorkommen.

source: module_rename %(old) %(new).
de_de: Erneute Definition des Modulnamens "%(old)" durch "%(new)".

source: no_module
de_de: Kein Modul definiert. Module werden wie folgt definiert: "module foo".

source: no_module %(mod)
de_de: Das Modul "%(mod)" wurde nicht gefunden.

source: type_parameter_given_to_primitive_builtin_type %(type)
de_de: Typparamter wurden dem eingebauten Typ "%(type)" gegeben, der aber keine Parameter erwartet.

source: unexpected_token %(token)
de_de: Syntaxfehler nahe "%(token)".

source: unknown_error %(raw_error_term)
de_de: %(raw_error_term) Wir bitten um Verzeihung, bisweilen wurde noch keine geeignete Fehlermeldung für diesen Fehler erstellt. Wir würden uns freuen, wenn Sie uns Ihr Problem beschreiben, und helfen Ihnen gerne weiter unter: https://www.github.com/alpaca-lang/alpaca/issues.
